const TelegramBot = require('node-telegram-bot-api');

const TOKEN = '8533729743:AAFWZemowIDF64YOxHldgERZaamVTsfNkBU';

const bot = new TelegramBot(TOKEN, { polling: true });

console.log('Bot started');

bot.onText(/\/start/, (msg) => {
  const chatId = msg.chat.id;

  const text = `
<blockquote>
Вы не приобретаете наркотические вещества или запрещённые предметы.

Передаваемые вам координаты не содержат никаких материальных объектов. Они являются частью виртуального квеста, цель которого — пройти маршрут и достичь указанной точки.

Иными словами, оплата не предполагает получение физического товара. Мы предоставляем исключительно участие в виртуальном квесте и не гарантируем выдачу какой-либо материальной ценности.
</blockquote>

<b>Пожалуйста, выберите: «Согласен» или «Не согласен».</b>
`;

  bot.sendMessage(chatId, text, {
    parse_mode: 'HTML',
    reply_markup: {
      inline_keyboard: [
        [{ text: '✅ Согласен', callback_data: 'agree' }],
        [{ text: '❌ Не согласен', callback_data: 'disagree' }]
      ]
    }
  });
});

bot.on('callback_query', (query) => {
  const chatId = query.message.chat.id;

  if (query.data === 'agree') {
    bot.sendMessage(chatId, 'Вы приняли условия. Можем продолжать 🚀', {
      reply_markup: {
        inline_keyboard: [
          [{ text: 'Покупка 💰', callback_data: 'buy' }],
          [{ text: 'Как? 🤫', callback_data: 'how' }]
        ]
      }
    });
  }

if (query.data === 'buy') {
  bot.sendMessage(chatId, 'Вам надо написать администратору', {
    reply_markup: {
      inline_keyboard: [
        [
          { text: 'Написать', url: 'https://t.me/Paradoxium_NS' }
        ]
      ]
    }
  });
}


  if (query.data === 'how') {
    bot.sendMessage(chatId, `
Пишите администратору — @Paradoxium_NS.

Спрашиваете, что есть,
делаете оплату и отправляете свой город или улицу — с указанием улицы будет проще.
После этого вам приходят координаты.
`);
  }

  bot.answerCallbackQuery(query.id);
});


